#include "lpc17xx.h"
#include "io.h"


//=============================sensor 传感器IO口配置=================================
/*------------------------------引脚    标号    功能---------------------------------
 P1.0	signal0	  	misumi sensor max			P1.1    signal1		misumi sensor mid
 P1.4	signal2		misumi sensor min			  P1.8    signal3	    笔形气缸front
 P1.9	signal4  	笔形气缸bottom   			  P1.10   signal5		夹紧气缸front
 P1.14  signal6	    夹紧气缸bottom			P1.15   signal7		pogopin up
 P1.16	signal8		pogopin down				  P1.17	signal9	    3pad up
 P1.18	signal10	3pad down				      P1.19	signal1		
 P1.20	signal12                  			P1.21	signal3		 
 P1.30  SIGNAL14	 			        		    P1.31   SIGNAL15	  
*/
void Sensor_IO_Init(void)
{
	LPC_PINCON->PINSEL2 &=~((3<<0)|(3<<2)|(3<<8)|(3<<16)|(3<<18)|(3<<20)|(3<<28)|((unsigned int)3<<30));//分别是P1.0 P1.1 P1.4 P1.8 P1.9 P1.10 P1.14 P1.15
	LPC_PINCON->PINSEL3 &=~((3<<0)|(3<<2)|(3<<4)|(3<<6)|(3<<8)|(3<<10));//分别是P1.16 P1.17 P1.18 P1.19 P1.20 P1.21
	LPC_GPIO1->FIODIR &=~((1<<0 )|(1<<1)|(1<<4)|(1<<8 )|(1<<9)|(1<<10)|
						(1<<14)|(1<<15)|(1<<16)|(1<<17)|(1<<18)|(1<<19)|(1<<20)|(1<<21));
						// 配置IO设置输出模式 ，为1设置输出，为0设置输入   (输出)
	LPC_GPIO1->FIOPIN |= ((1<<0 )|(1<<1)|(1<<4)|(1<<8 )|(1<<9)|(1<<10)|
					     (1<<14)|(1<<15)|(1<<16)|(1<<17)|(1<<18)|(1<<19)|(1<<20)|(1<<21));
	LPC_PINCON->PINSEL3 &=~((3<<28)|((unsigned int)3<<30)); //=======配置普通IO输P1.30  P1.31 signal14 signal15=======
    LPC_GPIO1->FIODIR &=~ ((1<<30)|((unsigned int)1<<31));  //=======配置普通输入=========
	LPC_GPIO1->FIOPIN |= ((1<<30)|((unsigned int)1<<31));	  //=======上电输入为高电平=====

}
 //======================star  IO口配置(输入)========================================//
 //=======butonA:P0.5   butonB:P0.6	 REST:P0.7   STOP:P0.8===========================//   
void Start_IO_Init(void)
{
	LPC_PINCON->PINSEL0 &=~((3<<10)|(3<<12)|(3<<14)|(3<<16));
	LPC_GPIO0->FIODIR &=~((1<<5 )|(1<<6)|(1<<7)|(1<<8 ));						// 配置IO设置输出模式 ，为1设置输出，为0设置输入
	LPC_GPIO0->FIOPIN |= ((1<<5 )|(1<<6)|(1<<7)|(1<<8));
}
//======================relay IO配置（输出）=========================================
//--------  P0.23  P0.24 ----------------------------------
void Relay_IO_Init(void)
{
	LPC_PINCON->PINSEL1 &=~((3<<14)|(3<<16));
	LPC_GPIO0->FIODIR |=((1<<23)|(1<<24 ));	// 配置IO设置输出模式 ，为1设置输出，为0设置输入
	LPC_GPIO0->FIOPIN &=~((1<<23)|(1<<24 ));	//默认上电为低 电平
}

//=========================Cylinder  IO口配置=========================================//
//==电磁阀0：P0.15  电磁阀1：P0.16 电磁阀2：P0.17 电磁阀3：P0.18 电磁阀4：P0.19  电磁阀5：P0.20  电磁阀6：P0.21 电磁阀7：P0.22======//
void Cylinder_IO_Init(void)
{
	LPC_PINCON->PINSEL0 &=~((unsigned int)3<<30);				   //去掉
	LPC_GPIO0->FIODIR |=(1<<15);
	LPC_GPIO0->FIOPIN &=~(1<<15);

	LPC_PINCON->PINSEL1 &=~((3<<0)|(3<<2)|(3<<4)|(3<<6)|(3<<8)|(3<<10)|(3<<12)) ;
	LPC_GPIO0->FIODIR |=((1<<16 )|(1<<17)|(1<<18)|(1<<19)|(1<<20)|(1<<21)|(1<<22));
	LPC_GPIO0->FIOPIN&=~((1<<16 )|(1<<17)|(1<<18)|(1<<19 )|(1<<20)|(1<<21)|(1<<22));
	
}
//===================================================================================
void MOTOR_IO_Init(void)  //  P1.22 P1.23 P1.24 P1.25 P1.26 P1.27 P1.28 P1.29 
{
	/*电机IO 初始化*/
  LPC_PINCON->PINSEL3 &=~((3<<12)|(3<<14)|(3<<16)|(3<<18)|(3<<20)|(3<<22)|(1<<24)|(1<<26));		//分别是 P1.22 P1.23 P1.24 P1.25 P1.26 P1.27 P1.28 P1.29
  LPC_GPIO1->FIODIR |=((1<<22 )|(1<<23)|(1<<24)|(1<<25)|(1<<26)|(1<<27)|(1<<28)|(1<<29)); 	  // 配置IO设置输出模式 ，为1设置输出，为0设置输入 (输出)
  LPC_GPIO1->FIOPIN |=((1<<22 )|(1<<23)|(1<<24)|(1<<25)|(1<<26)|(1<<27)|(1<<28)|(1<<29));	    //=======上电输入为高电平=====
}
//===================================================================================
void RS485_IO_Init(void ) //  P0.9 P0.10 P0.11
{
  LPC_PINCON->PINSEL0 &=~((3<<18));//485 EN P0.9 选择GPIO
  LPC_GPIO0->FIODIR   |= ( (1<<9));//485 EN P0.9 方向置为输出
  //LPC_GPIO0->FIOPIN   &=~( (1<<9));//置为低电平

}
//===================== 所用的IO初始化 ==============================================
void IO_Init(void)
{
	Sensor_IO_Init();	  //传感器IO配置
 	Start_IO_Init();	  //启动按钮IO配置
 	Cylinder_IO_Init();	//汽缸IO配置
	Relay_IO_Init();    //板上继电器IO配置
  RS485_IO_Init();    //485 IO配置
}


